RoSchmi/Esp32_Viessm_DatBase_Bridge/src/main.cpp
#include <Arduino.h>

// Program 'Esp32_Viessm_DatBase_Bridge' Branch Master
#define PROGRAMVERSION "v1.0.0"
// Last updated: 2024_11_01
// Copyright: RoSchmi 2024 License: Apache 2.0
// the App was tested only on ESP32, not sure if it works on variations of ESP32
// or ESP8266

// Now uses
// platform espressif32@6.7.0 and platform_package framework-arduinoespressif32 @ 3.20017.0
// Switched to built-in Filesystem 'LittleFS' instead of 'LITTLEFS'
//
// In cases of a wrong (old) format of the LittleFS flash storage,
// the flash must be cleared with the command (cmd window)
// python C:\Users\<user>\.platformio\packages\tool-esptoolpy\esptool.py erase_flash

// If you still have problems with formatting the flash for LittleFS, try to use
// https://github.com/RoSchmi/ESP32_LittleFS_Simple_Formatter

// Definition of your TimeZone has to be made in config.h
// Original Timezone_Generic library by Khoih-prog is not used
// (didn't take the time to understand) instead I used a modification
// which is part of this App (lib/RoSchmi/RSTimeZone/src)

// The application doesn't compile without a trick:
// The libraries NTPClient_Generic and Timezone_Generic load the
// dependency:
// {
//      "owner": "khoih-prog",
//      "name": "ESP8266_AT_WebServer",
//      "version": ">=1.5.4",
//      "platforms": ["*"]
//    },
// This dependency doesn't compile. So we delete in folder libdeps/ESP32 
// the dependency in the 'library.json' file and delete the entry 
// 'ESP8266_AT_WebServer' in the folder libdeps/ESP32


// This App for Esp32 monitors the activity of the burner of an oil-heating
// (or any other noisy thing) by measuring the sound of e.g. the heating burner 
// using an I2S microphone (Adafruit SPH0645 or INMP441)
// The on/off states are transferred to the Cloud (Azure Storage Tables)
// via WLAN and internet and can be visulized graphically through the iPhone- or Android-App
// Charts4Azure.
// The Router-WiFi Credentials can be entered via a Captive Portal page which is provided for one minute
// by the Esp32 after powering up the device. After having entered the credentials
// one time they stay permanently on the Esp32 and need not to be entered every time.

// This App uses an adaption of the 'Async_ConfigOnStartup.ino' as WiFi Mangager
// from: -https://github.com/khoih-prog/ESPAsync_WiFiManager 
// More infos about the functions and Licenses see:
// -https://github.com/khoih-prog/ESPAsync_WiFiManager/blob/master/examples/Async_ConfigOnDoubleReset_Multi
// -https://github.com/khoih-prog/ESPAsync_WiFiManager/tree/master/examples/Async_ConfigOnStartup
 

// The WiFiManager will open a configuration portal in the WLAN Access-Point for 60 seconds when powered up 
// if the boards has stored WiFi Credentials, otherwise, the Access Point will stay indefinitely in ConfigPortal 
// until the Router WiFi Credentials are entered.
// The Name (SSID) of the Access Point is e.g. ESP32_xxxxxx, if a password is requested (only the first time),
// the passwort is "My" + the SSID-Name, e.g. MyESP32_xxxxxx.
 
#include <Arduino.h>
#include <time.h>
#include "ESPAsyncWebServer.h"
#include "defines.h"
#include "config.h"
#include "config_secret.h"
#include "DateTime.h"
#include <freertos/FreeRTOS.h>
#include "Esp.h"
#include "esp_task_wdt.h"
#include "rom/rtc.h"


#include "CloudStorageAccount.h"
#include "TableClient.h"
#include "TableEntityProperty.h"
#include "TableEntity.h"
#include "AnalogTableEntity.h"
#include "OnOffTableEntity.h"

#include "ViessmannApiAccount.h"
#include "ViessmannClient.h"
#include "ViessmannApiSelection.h"

#include "NTPClient_Generic.h"
#include "Timezone_Generic.h"
#include "WiFiUdp.h"
#include "WiFiClient.h"
#include "HTTPClient.h"

#include "DataContainerWio.h"
#include "OnOffDataContainerWio.h"
#include "OnOffSwitcherWio.h"
#include "SoundSwitcher.h"
#include "ImuManagerWio.h"
#include "AnalogSensorMgr.h"

#include "azure/core/az_platform.h"
#include "azure/core/az_http.h"
#include "azure/core/az_http_transport.h"
#include "azure/core/az_result.h"
#include "azure/core/az_config.h"
#include "azure/core/az_context.h"
#include "azure/core/az_span.h"

#include "Rs_TimeNameHelper.h"

// Now support ArduinoJson 6.0.0+ ( tested with v6.14.1 )
#include "ArduinoJson.h"      // get it from https://arduinojson.org/ or install via Arduino library manager

// Default Esp32 stack size of 8192 byte is not enough for this application.
// --> configure stack size dynamically from code to 16384
// https://community.platformio.org/t/esp32-stack-configuration-reloaded/20994/4

//SET_LOOP_TASK_STACK_SIZE ( 16*1024 ); // 16KB

SET_LOOP_TASK_STACK_SIZE ( 32*1024 ); // 20KB

// Allocate memory space in memory segment .dram0.bss, ptr to this memory space is later
// passed to TableClient (is used there as the place for some buffers to preserve stack )

//const uint16_t bufferStoreLength = 4000;

const uint16_t bufferStoreLength = 20000;
uint8_t bufferStore[bufferStoreLength] {0};
uint8_t * bufferStorePtr = &bufferStore[0];

char viessmannClientId[50] = VIESSMANN_CLIENT_ID;
char viessmannAccessToken[1120] = VIESSMANN_ACCESS_TOKEN;
char viessmannUserBaseUri[60] = VIESSMANN_USER_Base_URI;
char viessmannIotBaseUri[60] = VIESSMANN_IOT_Base_URI;

static bool ViessmannUseHttps_State = VIESSMANN_TRANSPORT_PROTOCOL == 0 ? false : true;

ViessmannApiAccount myViessmannApiAccount(viessmannClientId, viessmannAccessToken, viessmannIotBaseUri, viessmannUserBaseUri, ViessmannUseHttps_State); 
ViessmannApiAccount * myViessmannApiAccountPtr = &myViessmannApiAccount;

ViessmannApiSelection viessmannApiSelection(DateTime(), TimeSpan(VIESSMANN_API_READ_INTERVAL_SECONDS));
ViessmannApiSelection * viessmannApiSelectionPtr = &viessmannApiSelection;

//DataContainerWio dataContainer(TimeSpan(sendIntervalSeconds), TimeSpan(0, 0, INVALIDATEINTERVAL_MINUTES % 60, 0), (float)MIN_DATAVALUE, (float)MAX_DATAVALUE, (float)MAGIC_NUMBER_INVALID);


bool viessmannUserId_is_read = false;
const uint16_t viessmannUserBufLen = 1000;
uint8_t viessmannApiUser [viessmannUserBufLen] {0};

bool viessmannEquip_is_read = false;
uint32_t Data_0_Id = 0;
const int equipBufLen = 35;
char Data_0_Description[equipBufLen]= {0};
char Data_0_Address_Street[equipBufLen] {0};
char Data_0_Address_HouseNumber[equipBufLen] = {0};
char Gateways_0_Serial[equipBufLen] = {0};
char Gateways_0_Devices_0_Id[equipBufLen] = {0};

//void * StackPtrAtStart;
//void * StackPtrEnd;
UBaseType_t * StackPtrAtStart;
UBaseType_t * StackPtrEnd;

UBaseType_t watermarkStart;
TaskHandle_t taskHandle_0 =  xTaskGetCurrentTaskHandleForCPU(0);
TaskHandle_t taskHandle_1 =  xTaskGetCurrentTaskHandleForCPU(1);

