RoSchmi/Esp32_Viessm_DatBase_Bridge/src/main.cpp
bool watchDogEnabled = false;
bool watchDogCommandSuccessful = false;

RESET_REASON resetReason_0;
RESET_REASON resetReason_1;

uint8_t lastResetCause = 0;

#define GPIOPin 0
bool buttonPressed = false;

const char analogTableName[45] = ANALOG_TABLENAME;

const char OnOffTableName_1[45] = ON_OFF_TABLENAME_01;
const char OnOffTableName_2[45] = ON_OFF_TABLENAME_02;
const char OnOffTableName_3[45] = ON_OFF_TABLENAME_03;
const char OnOffTableName_4[45] = ON_OFF_TABLENAME_04;

// The PartitionKey for the analog table may have a prefix to be distinguished, here: "Y2_" 
const char * analogTablePartPrefix = (char *)ANALOG_TABLE_PART_PREFIX;

// The PartitionKey for the On/Off-tables may have a prefix to be distinguished, here: "Y3_" 
const char * onOffTablePartPrefix = (char *)ON_OFF_TABLE_PART_PREFIX;

// The PartitinKey can be augmented with a string representing year and month (recommended)
const bool augmentPartitionKey = true;

// The TableName can be augmented with the actual year (recommended)
const bool augmentTableNameWithYear = true;

typedef const char* X509Certificate;

typedef int t_httpCode;

t_httpCode httpCode = -1;


// https://techcommunity.microsoft.com/t5/azure-storage/azure-storage-tls-critical-changes-are-almost-here-and-why-you/ba-p/2741581
// baltimore_root_ca will expire in 2025, then take digicert_globalroot_g2_ca
//X509Certificate myX509Certificate = baltimore_root_ca;

X509Certificate myX509Certificate = digicert_globalroot_g2_ca;

// Init the Secure client object

#if TRANSPORT_PROTOCOL == 1
    static WiFiClientSecure wifi_client;
  #else
    static WiFiClient wifi_client;
  #endif

  // A UDP instance to let us send and receive packets over UDP
  WiFiUDP ntpUDP;
  static NTPClient timeClient(ntpUDP);
  
  HTTPClient http;
  
  // Ptr to HTTPClient
  static HTTPClient * httpPtr = &http;

// Define Datacontainer with SendInterval and InvalidateInterval as defined in config.h
int sendIntervalSeconds = (SENDINTERVAL_MINUTES * 60) < 1 ? 1 : (SENDINTERVAL_MINUTES * 60);

DataContainerWio dataContainer(TimeSpan(sendIntervalSeconds), TimeSpan(0, 0, INVALIDATEINTERVAL_MINUTES % 60, 0), (float)MIN_DATAVALUE, (float)MAX_DATAVALUE, (float)MAGIC_NUMBER_INVALID);

DataContainerWio viesmAnalogdataCont01(TimeSpan(sendIntervalSeconds), TimeSpan(0, 0, INVALIDATEINTERVAL_MINUTES % 60, 0), (float)MIN_DATAVALUE, (float)MAX_DATAVALUE, (float)MAGIC_NUMBER_INVALID);

AnalogSensorMgr analogSensorMgr(MAGIC_NUMBER_INVALID);

OnOffDataContainerWio onOffDataContainer;

OnOffSwitcherWio onOffSwitcherWio;

// Possible configuration for Adafruit Huzzah Esp32
static const i2s_pin_config_t pin_config_Adafruit_Huzzah_Esp32 = {
    .bck_io_num = 14,                   // BCKL
    .ws_io_num = 15,                    // LRCL
    .data_out_num = I2S_PIN_NO_CHANGE,  // not used (only for speakers)
    .data_in_num = 32                   // DOUT
};
// Possible configuration for some Esp32 DevKitC V4
static const i2s_pin_config_t pin_config_Esp32_dev = {
    .bck_io_num = 26,                   // BCKL
    .ws_io_num = 25,                    // LRCL
    .data_out_num = I2S_PIN_NO_CHANGE,  // not used (only for speakers)
    .data_in_num = 22                   // DOUT
};

MicType usedMicType = (USED_MICROPHONE == 0) ? MicType::SPH0645LM4H : MicType::INMP441;

SoundSwitcher soundSwitcher(pin_config_Esp32_dev, usedMicType);
//SoundSwitcher soundSwitcher(pin_config_Adafruit_Huzzah_Esp32, usedMicType);

FeedResponse feedResult;

int soundSwitcherUpdateInterval = SOUNDSWITCHER_UPDATEINTERVAL;
uint32_t soundSwitcherReadDelayTime = SOUNDSWITCHER_READ_DELAYTIME;

uint64_t loopCounter = 0;
int insertCounterAnalogTable = 0;
uint32_t tryUploadCounter = 0;
uint32_t failedUploadCounter = 0;
uint32_t timeNtpUpdateCounter = 0;
// not used on Esp32
int32_t sysTimeNtpDelta = 0;

  bool ledState = false;
  
  const int timeZoneOffset = (int)TIMEZONEOFFSET;
  const int dstOffset = (int)DSTOFFSET;

  Rs_TimeNameHelper timeNameHelper;

  DateTime dateTimeUTCNow;    // Seconds since 2000-01-01 08:00:00

  Timezone myTimezone;

// Set transport protocol as defined in config.h
static bool UseHttps_State = TRANSPORT_PROTOCOL == 0 ? false : true;


const char * CONFIG_FILE = "/ConfigSW.json";    // Configuration for Azure and threshold
                                                // 'CONFIG_FILENAME' is used for Router Credentials

#define AZURE_CONFIG_ACCOUNT_NAME "AzureStorageAccName"

#define AZURE_CONFIG_ACCOUNT_KEY   "YourStorageAccountKey"

/*
char viessmannClientId[50] = VIESSMANN_CLIENT_ID;
char viessmannAccessToken[1120] = VIESSMANN_ACCESS_TOKEN;
char viessmannUserBaseUri[60] = VIESSMANN_USER_Base_URI;
char viessmannIotBaseUri[60] = VIESSMANN_IOT_Base_URI;
*/

// Parameter for WiFi-Manager
char azureAccountName[20] =  AZURE_CONFIG_ACCOUNT_NAME;
char azureAccountKey[90] =  AZURE_CONFIG_ACCOUNT_KEY;
char sSwiThresholdStr[6] = SOUNDSWITCHER_THRESHOLD;

#define AzureAccountName_Label "azureAccountName"
#define AzureAccountKey_Label "azureAccountKey"
#define SoundSwitcherThresholdString_Label "sSwiThresholdStr"

// Function Prototypes for WiFiManager
bool readConfigFile();
bool writeConfigFile();

// Note: AzureAccountName and azureccountKey will be changed later in setup
CloudStorageAccount myCloudStorageAccount(azureAccountName, azureAccountKey, UseHttps_State);
CloudStorageAccount * myCloudStorageAccountPtr = &myCloudStorageAccount;

/*
ViessmannApiAccount myViessmannApiAccount(viessmannClientId, viessmannAccessToken, viessmannIotBaseUri, viessmannUserBaseUri, ViessmannUseHttps_State); 
ViessmannApiAccount * myViessmannApiAccountPtr = &myViessmannApiAccount;
*/

void GPIOPinISR()
{
  buttonPressed = true;
}

// function forward declarations
float ReadViessmannApi_01(int pSensorIndex);
t_httpCode readFeaturesFromApi(X509Certificate pCaCert, ViessmannApiAccount * myViessmannApiAccountPtr, uint32_t Data_0_Id, const char * p_gateways_0_serial, const char * p_gateways_0_devices_0_id, ViessmannApiSelection * apiSelectionPtr);
t_httpCode readEquipmentFromApi(X509Certificate pCaCert, ViessmannApiAccount * myViessmannApiAccountPtr, uint32_t * p_data_0_id, const int equipBufLen, char * p_data_0_description, char * p_data_0_address_street, char * p_data_0_address_houseNumber, char * p_gateways_0_serial, char * p_gateways_0_devices_0_id);
t_httpCode readUserFromApi(X509Certificate pCaCert, ViessmannApiAccount * myViessmannApiAccountPtr);
void print_reset_reason(RESET_REASON reason);
void scan_WIFI();
String floToStr(float value);
float ReadAnalogSensor(int pSensorIndex);
void createSampleTime(DateTime dateTimeUTCNow, int timeZoneOffsetUTC, char * sampleTime);
az_http_status_code  createTable(CloudStorageAccount * myCloudStorageAccountPtr, X509Certificate pCaCert, const char * tableName);
az_http_status_code insertTableEntity(CloudStorageAccount *myCloudStorageAccountPtr,X509Certificate pCaCert, const char * pTableName, TableEntity pTableEntity, char * outInsertETag);
void makePartitionKey(const char * partitionKeyprefix, bool augmentWithYear, DateTime dateTime, az_span outSpan, size_t *outSpanLength);
void makeRowKey(DateTime actDate, az_span outSpan, size_t *outSpanLength);
int getDayNum(const char * day);
int getMonNum(const char * month);
int getWeekOfMonthNum(const char * weekOfMonth);
uint8_t connectMultiWiFi();

// Here: Begin of WiFi Manager definitions
//***************************************************************

#if !( defined(ESP8266) ||  defined(ESP32) )
  #error This code is intended to run on the ESP8266 or ESP32 platform! Please check your Tools->Board setting.
#endif

