RoSchmi/Esp32_Viessm_DatBase_Bridge/src/main.cpp
    if ( WM_config.checksum != calcChecksum( (uint8_t*) &WM_config, sizeof(WM_config) - sizeof(WM_config.checksum) ) )
    {
      LOGERROR(F("WM_config checksum wrong"));  
      return false;
    }
    
    displayIPConfigStruct(WM_STA_IPconfig);
   
    return true;
  }
  else
  {
    LOGERROR(F("failed"));

    return false;
  }
}

void saveConfigData()   // Save Router WiFi-Credentials to file
{
  File file = FileFS.open(CONFIG_FILENAME, "w");
  LOGERROR(F("SaveWiFiCfgFile "));

  if (file)
  {
    WM_config.checksum = calcChecksum( (uint8_t*) &WM_config, sizeof(WM_config) - sizeof(WM_config.checksum) );   
    file.write((uint8_t*) &WM_config, sizeof(WM_config));
    displayIPConfigStruct(WM_STA_IPconfig);

    file.write((uint8_t*) &WM_STA_IPconfig, sizeof(WM_STA_IPconfig));
    
    file.close();
    LOGERROR(F("OK"));
  }
  else
  {
    LOGERROR(F("failed"));
  }
}

bool readConfigFile()    // Config parameter for Azure credentials and threshold
{
  // this opens the config file in read-mode
  File f = FileFS.open(CONFIG_FILE, "r");

  if (!f)
  {
    Serial.println(F("Configuration file not found"));
    return false;
  }
  else
  { 
    // we could open the file
    size_t size = f.size();
    // Allocate a buffer to store contents of the file.
    std::unique_ptr<char[]> buf(new char[size + 1]);

    // Read and store file contents in buf
    f.readBytes(buf.get(), size);
    // Closing file
    f.close();
    // Using dynamic JSON buffer which is not the recommended memory model, but anyway
    // See https://github.com/bblanchon/ArduinoJson/wiki/Memory%20model

#if (ARDUINOJSON_VERSION_MAJOR >= 6)
    
    DynamicJsonDocument json(1024);
    auto deserializeError = deserializeJson(json, buf.get());
    if ( deserializeError )
    {
      Serial.println(F("JSON parseObject() failed"));
      return false;
    }
    Serial.println(F("Here we could print the custom parameters like Azure Credentials read from filesystem"));
    //serializeJson(json, Serial);
#else
    DynamicJsonBuffer jsonBuffer;
    // Parse JSON string
    JsonObject& json = jsonBuffer.parseObject(buf.get());
    // Test if parsing succeeds.
    if (!json.success())
    {
      Serial.println(F("JSON parseObject() failed"));
      return false;
    }
    json.printTo(Serial);
#endif

    // Parse all config file parameters, override
    // local config variables with parsed values    
    if (json.containsKey(AzureAccountName_Label))
    {
      strcpy(azureAccountName, json[AzureAccountName_Label]);      
    }
    if (json.containsKey(AzureAccountKey_Label))
    {
      strcpy(azureAccountKey, json[AzureAccountKey_Label]);    
    }
    if (json.containsKey(SoundSwitcherThresholdString_Label))
    {
      strcpy(sSwiThresholdStr, json[SoundSwitcherThresholdString_Label]);      
    }
  }
  Serial.println(F("\nCustom config file was successfully parsed")); 
  return true;
}

bool writeConfigFile()
{
  LOGERROR(F("Saving additional config to file"));
  
#if (ARDUINOJSON_VERSION_MAJOR >= 6)
  DynamicJsonDocument json(1024);
#else
  DynamicJsonBuffer jsonBuffer;
  JsonObject& json = jsonBuffer.createObject();
#endif

  // JSONify local configuration parameters 
  json[AzureAccountName_Label] = azureAccountName;
  json[AzureAccountKey_Label] = azureAccountKey;
  json[SoundSwitcherThresholdString_Label] = sSwiThresholdStr;
  // Open file for writing
  File f = FileFS.open(CONFIG_FILE, "w");
  
  if (!f)
  {
    Serial.println(F("Failed to open config file for writing"));
    return false;
  }

#if (ARDUINOJSON_VERSION_MAJOR >= 6)

  Serial.println(F("Here we could print the additional config parameter written to file"));
  //serializeJsonPretty(json, Serial);

  // Write data to file and close it
  serializeJson(json, f);
#else
  json.prettyPrintTo(Serial);
  // Write data to file and close it
  json.printTo(f);
#endif

  f.close();

  Serial.println(F("\nConfig file was successfully saved"));
  return true;
}

void setup()
{
  // At the begin of setup we get some information about
  // stack, heap and watchdog

  // Get Stackptr at start of setup()
  //void* SpStart = NULL;
  UBaseType_t * SpStart = NULL;
  //StackPtrAtStart = (void *)&SpStart;
  StackPtrAtStart = (UBaseType_t *)&SpStart;
  
  // Get StackHighWatermark at start of setup()
  watermarkStart =  uxTaskGetStackHighWaterMark(NULL);
  // Calculate (not exact) end-address of the stack
  StackPtrEnd = StackPtrAtStart - watermarkStart;

  __unused uint32_t minFreeHeap = esp_get_minimum_free_heap_size();
  uint32_t freeHeapSize = esp_get_free_heap_size();
  
  /*
  UBaseType_t watermarkStart_0 = uxTaskGetStackHighWaterMark(taskHandle_0);
  UBaseType_t watermarkStart_1 = uxTaskGetStackHighWaterMark(NULL);
  */

  resetReason_0 = rtc_get_reset_reason(0);
  resetReason_1 = rtc_get_reset_reason(1);
  lastResetCause = resetReason_1;  

  // Disable watchdog
  // volatile int wdt_State = esp_task_wdt_status(NULL);
  // volatile int wdt_deinit_result = esp_task_wdt_deinit();
  // ESP_ERR_INVALID_STATE  -- 259
  // ESP_ERR_NOT_FOUND -- 261

    if ((esp_task_wdt_status(NULL) == ESP_ERR_NOT_FOUND) || (esp_task_wdt_deinit() == ESP_OK))
    {
      watchDogEnabled = false;
      watchDogCommandSuccessful = true;    
    }
    else
    {
      watchDogCommandSuccessful = false;   
    }
  
  // initialize the LED digital pin as an output.
  pinMode(LED_BUILTIN, OUTPUT);
  
  Serial.begin(115200);
  while (!Serial);

  delay(4000);
  
  // is needed for Button
  // attachInterrupt(GPIOPin, GPIOPinISR, RISING);
  
  Serial.printf("\r\n\r\nAddress of Stackpointer near start is:  %p \r\n",  (void *)StackPtrAtStart);
  Serial.printf("End of Stack is near:                   %p \r\n",  (void *)StackPtrEnd);
  Serial.printf("Free Stack near start is:  %d \r\n",  (uint32_t)StackPtrAtStart - (uint32_t)StackPtrEnd);

  /*
  // Get free stack at actual position (can be used somewhere in program)
  void* SpActual = NULL;
  Serial.printf("\r\nFree Stack at actual position is: %d \r\n", (uint32_t)&SpActual - (uint32_t)StackPtrEnd);
  */

