RoSchmi/Esp32_Viessm_DatBase_Bridge/src/main.cpp
#if ESP8266
      configTime(WM_config.TZ, "pool.ntp.org"); 
#else
      //configTzTime(WM_config.TZ, "pool.ntp.org" );
      configTzTime(WM_config.TZ, "time.nist.gov", "0.pool.ntp.org", "1.pool.ntp.org");
#endif
    }
    else
    {
      LOGERROR(F("Current Timezone Name is not set. Enter Config Portal to set."));
    }
#endif

    ESPAsync_wifiManager.getSTAStaticIPConfig(WM_STA_IPconfig);
    LOGERROR(F("Here we could print Router WiFi Credentals saved to file"));
    for (uint8_t i = 0; i < NUM_WIFI_CREDENTIALS; i++)
    {
      LOGERROR3(F("Saved SSID: "), WM_config.WiFi_Creds[i].wifi_ssid, F(", PW = "), WM_config.WiFi_Creds[i].wifi_pw );
    }
    saveConfigData();
  }

  
  
  // Getting posted form values and overriding local variables parameters
  // Config file is written regardless the connection state 
  strcpy(azureAccountName, p_azureAccountName.getValue());
  if (strlen(p_azureAccountKey.getValue()) > 1)
  {
    strcpy(azureAccountKey, p_azureAccountKey.getValue());
  }
  strcpy(sSwiThresholdStr, p_soundSwitcherThreshold.getValue());
    
    // Writing JSON config file to flash for next boot

  writeConfigFile();

  digitalWrite(LED_BUILTIN, LED_OFF); // Turn led off as we are not in configuration mode.

  

  startedAt = millis();



  // Azure Acount must be updated here with eventually changed values from WiFi-Manager
  myCloudStorageAccount.ChangeAccountParams((char *)azureAccountName, (char *)azureAccountKey, UseHttps_State);
  
  #if WORK_WITH_WATCHDOG == 1
    // Start watchdog with 20 seconds
    if (esp_task_wdt_init(20, true) == ESP_OK)
    {
      Serial.println(F("\r\nWatchdog enabled with interval of 20 sec\r\n"));
    }
    else
    {
      Serial.println(F("Failed to enable watchdog"));
    }
    esp_task_wdt_add(NULL);

    //https://www.az-delivery.de/blogs/azdelivery-blog-fur-arduino-und-raspberry-pi/watchdog-und-heartbeat

    //https://docs.espressif.com/projects/esp-idf/en/latest/esp32/api-reference/system/wdts.html
  #endif

   if ( WiFi.status() != WL_CONNECTED )
    {
      Serial.println(F("ConnectMultiWiFi in setup"));

      connectMultiWiFi();
    }

    Serial.print(F("After waiting "));
  Serial.print((float) (millis() - startedAt) / 1000);
  Serial.print(F(" secs more in setup(), connection result is "));

  if (WiFi.status() == WL_CONNECTED)
  {
    Serial.print(F("connected. Local IP: "));
    Serial.println(WiFi.localIP());
  }
  else
    Serial.println(ESPAsync_wifiManager.getStatus(WiFi.status()));

  uint8_t status;
  int i = 0;
  status = wifiMulti.run();
             
  delay(800L);  //(WIFI_MULTI_1ST_CONNECT_WAITING_MS) 

  if ( status == WL_CONNECTED )
  {
    Serial.print(F("connected. Local IP: "));
    Serial.println(WiFi.localIP());
  }
  else
  {
    Serial.println(ESPAsync_wifiManager.getStatus(WiFi.status()));
    #if WORK_WITH_WATCHDOG == 1
      while (true)  // Wait to be rebooted by watchdog
      {
        delay(100);
      }
    #endif
  }

  /*
  while (true)
  {
    Serial.print(F("connected. Local IP: "));
    Serial.println(WiFi.localIP());
    delay (1000);
  }
  */

  soundSwitcher.begin(atoi((char *)sSwiThresholdStr), Hysteresis::Percent_10, soundSwitcherUpdateInterval, soundSwitcherReadDelayTime);
  soundSwitcher.SetCalibrationParams(-20.0);  // optional
  soundSwitcher.SetActive();
  //**************************************************************
  onOffDataContainer.begin(DateTime(), OnOffTableName_1, OnOffTableName_2, OnOffTableName_3, OnOffTableName_4);

  // Initialize State of 4 On/Off-sensor representations 
  // and of the inverter flags (Application specific)
  for (int i = 0; i < 4; i++)
  {
    onOffDataContainer.PresetOnOffState(i, false, true);
    onOffDataContainer.Set_OutInverter(i, true);
    onOffDataContainer.Set_InputInverter(i, false);
  }

  //Initialize OnOffSwitcher (for tests and simulation)
  onOffSwitcherWio.begin(TimeSpan(15 * 60));   // Toggle every 30 min
  //onOffSwitcherWio.SetInactive();
  onOffSwitcherWio.SetActive();

// Setting Daylightsavingtime. Enter values for your zone in file include/config.h
  // Program aborts in some cases of invalid values
  
  int dstWeekday = getDayNum(DST_START_WEEKDAY);
  int dstMonth = getMonNum(DST_START_MONTH);
  int dstWeekOfMonth = getWeekOfMonthNum(DST_START_WEEK_OF_MONTH);

  TimeChangeRule dstStart {DST_ON_NAME, (uint8_t)dstWeekOfMonth, (uint8_t)dstWeekday, (uint8_t)dstMonth, DST_START_HOUR, TIMEZONEOFFSET + DSTOFFSET};
  
  bool firstTimeZoneDef_is_Valid = (dstWeekday == -1 || dstMonth == - 1 || dstWeekOfMonth == -1 || DST_START_HOUR > 23 ? true : DST_START_HOUR < 0 ? true : false) ? false : true;
  
  dstWeekday = getDayNum(DST_STOP_WEEKDAY);
  dstMonth = getMonNum(DST_STOP_MONTH);
  dstWeekOfMonth = getWeekOfMonthNum(DST_STOP_WEEK_OF_MONTH);

  TimeChangeRule stdStart {DST_OFF_NAME, (uint8_t)dstWeekOfMonth, (uint8_t)dstWeekday, (uint8_t)dstMonth, (uint8_t)DST_START_HOUR, (int)TIMEZONEOFFSET};

  bool secondTimeZoneDef_is_Valid = (dstWeekday == -1 || dstMonth == - 1 || dstWeekOfMonth == -1 || DST_STOP_HOUR > 23 ? true : DST_STOP_HOUR < 0 ? true : false) ? false : true;
  
  if (firstTimeZoneDef_is_Valid && secondTimeZoneDef_is_Valid)
  {
    myTimezone.setRules(dstStart, stdStart);
  }
  else
  {
    // If timezonesettings are not valid: -> take UTC and wait for ever  
    TimeChangeRule stdStart {DST_OFF_NAME, (uint8_t)dstWeekOfMonth, (uint8_t)dstWeekday, (uint8_t)dstMonth, (uint8_t)DST_START_HOUR, (int)0};
    myTimezone.setRules(stdStart, stdStart);
    while (true)
    {
      Serial.println("Invalid DST Timezonesettings");
      delay(5000);
    }
  }
  
  Serial.println(F("Starting timeClient"));
  timeClient.begin();
  timeClient.setUpdateInterval((NTP_UPDATE_INTERVAL_MINUTES < 1 ? 1 : NTP_UPDATE_INTERVAL_MINUTES) * 60 * 1000);
  // 'setRetryInterval' should not be too short, may be that short intervals lead to malfunction 
  timeClient.setRetryInterval(20000);  // Try to read from NTP Server not more often than every 20 seconds
  Serial.println("Using NTP Server " + timeClient.getPoolServerName());
  
  timeClient.update();
  uint32_t counter = 0;
  uint32_t maxCounter = 10;
  
  while(!timeClient.updated() &&  counter++ <= maxCounter)
  {
    Serial.println(F("NTP FAILED: Trying again"));
    delay(1000);
    #if WORK_WITH_WATCHDOG == 1
      esp_task_wdt_reset();
    #endif
    timeClient.update();
  }

  if (counter >= maxCounter)
  {
    #if ESP8266      
    ESP.reset();
#else
    ESP.restart();
#endif  
    while(true)
    {
      delay(500); //Wait for ever, could not get NTP time, eventually reboot by Watchdog
    }
  }

  Serial.println("\r\n********UPDATED********");
    
