RoSchmi/Esp32_Viessm_DatBase_Bridge/src/main.cpp
  Serial.println("UTC : " + timeClient.getFormattedUTCTime());
  Serial.println("UTC : " + timeClient.getFormattedUTCDateTime());
  Serial.println("LOC : " + timeClient.getFormattedTime());
  Serial.println("LOC : " + timeClient.getFormattedDateTime());
  Serial.println("UTC EPOCH : " + String(timeClient.getUTCEpochTime()));
  Serial.println("LOC EPOCH : " + String(timeClient.getEpochTime()));

  unsigned long utcTime = timeClient.getUTCEpochTime();  // Seconds since 1. Jan. 1970
  
  dateTimeUTCNow =  utcTime;

  Serial.printf("%s %i %02d %02d %02d %02d", (char *)"UTC-Time is  :", dateTimeUTCNow.year(), 
                                        dateTimeUTCNow.month() , dateTimeUTCNow.day(),
                                        dateTimeUTCNow.hour() , dateTimeUTCNow.minute());
  Serial.println("");
  
  DateTime localTime = myTimezone.toLocal(dateTimeUTCNow.unixtime());
  
  Serial.printf("%s %i %02d %02d %02d %02d", (char *)"Local-Time is:", localTime.year(), 
                                        localTime.month() , localTime.day(),
                                        localTime.hour() , localTime.minute());
  Serial.println("");

  analogSensorMgr.SetReadInterval(ANALOG_SENSOR_READ_INTERVAL_SECONDS);
  
  
  httpCode = readUserFromApi(myX509Certificate, myViessmannApiAccountPtr);
  if (httpCode == t_http_codes::HTTP_CODE_OK)
  {
    Serial.println(F("UserId successfully read from Viessmann Cloud"));
    viessmannUserId_is_read = true;    
  }
  else
  {     
    Serial.println(F("Couldn't read UserId from Viessmann Cloud.\r\nError message is:"));
    Serial.println((char*)bufferStorePtr);
    ESP.restart();
    while(true)
    {
      delay(500);
    }
  }
  
  httpCode = readEquipmentFromApi(myX509Certificate, myViessmannApiAccountPtr, &Data_0_Id, equipBufLen, Data_0_Description, Data_0_Address_Street, Data_0_Address_HouseNumber, Gateways_0_Serial, Gateways_0_Devices_0_Id);
  if (httpCode == t_http_codes::HTTP_CODE_OK)
  {
    Serial.println(F("Equipment successfully read from Viessmann Cloud"));
    viessmannEquip_is_read = true;
  }
  else
  {     
    Serial.println(F("Couldn't read Equipment from Viessmann Cloud.\r\nError message is:"));
    Serial.println((char*)bufferStorePtr);
    ESP.restart();
    while(true)
    {
      delay(500);
    }
  }
  /*
  httpCode = readFeaturesFromApi(myX509Certificate, myViessmannApiAccountPtr, Data_0_Id, Gateways_0_Serial, Gateways_0_Devices_0_Id, viessmannApiSelectionPtr);
  if (httpCode == t_http_codes::HTTP_CODE_OK)
  {
    Serial.println(F("Features successfully read from Viessmann Cloud")); 
  }
  else
  {     
    Serial.println(F("Couldn't read Features from Viessmann Cloud.\r\nError message is:"));
    Serial.println((char*)bufferStorePtr);
    ESP.restart();
    while(true)
    {
      delay(500);
    }
  }
  */
}

void loop()
{
  check_status();   // Checks if WiFi is still connected
                    // if not, try other Accesspoint
  // put your main code here, to run repeatedly:
  if (++loopCounter % 100000 == 0)   // Make decisions to send data every 100000 th round and toggle Led to signal that App is running
  {
    
    ledState = !ledState;
    digitalWrite(LED_BUILTIN, ledState);    // toggle LED to signal that App is running

    #if WORK_WITH_WATCHDOG == 1
      esp_task_wdt_reset();
    #endif
    
      // Update RTC from Ntp when ntpUpdateInterval has expired, retry when RetryInterval has expired       
      if (timeClient.update())
      {                                                                      
        dateTimeUTCNow = timeClient.getUTCEpochTime();
        
        timeNtpUpdateCounter++;

        #if SERIAL_PRINT == 1
          // Indicate that NTP time was updated         
          char buffer[] = "NTP-Utc: YYYY-MM-DD hh:mm:ss";           
          dateTimeUTCNow.toString(buffer);
          Serial.println(buffer);
        #endif
      }  // End NTP stuff
          
      dateTimeUTCNow = timeClient.getUTCEpochTime();
      
      // Get offset in minutes between UTC and local time with consideration of DST
      int timeZoneOffsetUTC = myTimezone.utcIsDST(dateTimeUTCNow.unixtime()) ? TIMEZONEOFFSET + DSTOFFSET : TIMEZONEOFFSET;
      
      DateTime localTime = myTimezone.toLocal(dateTimeUTCNow.unixtime());

      // In the last 15 sec of each day we set a pulse to Off-State when we had On-State before
      bool isLast15SecondsOfDay = (localTime.hour() == 23 && localTime.minute() == 59 &&  localTime.second() > 45) ? true : false;
      
      float testValue = ReadViessmannApi_01(0);
     // viesmAnalogdataCont01.SetNewValue(0, dateTimeUTCNow, ReadViessmannApi_01(0));
      
      // Get readings from 4 differend analog sensors and store the values in a container     
       
      dataContainer.SetNewValue(0, dateTimeUTCNow, ReadAnalogSensor(0));
      dataContainer.SetNewValue(1, dateTimeUTCNow, ReadAnalogSensor(1));
      dataContainer.SetNewValue(2, dateTimeUTCNow, ReadAnalogSensor(2));
      dataContainer.SetNewValue(3, dateTimeUTCNow, ReadAnalogSensor(3));

     // viesmAnalogdataCont01.SetNewValue(0, dateTimeUTCNow, ReadAnalogSensor(0));

      

      // Check if automatic OnOfSwitcher has toggled (used to simulate on/off changes)
      // and accordingly change the state of one representation (here index 0 and 1) in onOffDataContainer
      if (onOffSwitcherWio.hasToggled(dateTimeUTCNow))
      {
        bool state = onOffSwitcherWio.GetState();
        onOffDataContainer.SetNewOnOffValue(2, state, dateTimeUTCNow, timeZoneOffsetUTC);
        onOffDataContainer.SetNewOnOffValue(3, !state, dateTimeUTCNow, timeZoneOffsetUTC);    
      }
        
        
        if (feedResult.isValid && (feedResult.hasToggled || feedResult.analogToSend))
        {
            if (feedResult.hasToggled)
            {
              onOffDataContainer.SetNewOnOffValue(0, feedResult.state, dateTimeUTCNow, timeZoneOffsetUTC);
              Serial.print("\r\nHas toggled, new state is: ");
              Serial.println(feedResult.state == true ? "High" : "Low");
              Serial.println();
            }
            // if toogled activate make hasToBeSent flag
            // so that the analog values have to be updated in the cloud
            if (feedResult.analogToSend)
            {
              dataContainer.setHasToBeSentFlag();
              Serial.print("Average is: ");
              Serial.println(feedResult.avValue);             
              Serial.println();
            }           
        }
        
      // Check if something is to do: send analog data ? send On/Off-Data ? Handle EndOfDay stuff ?
      if (dataContainer.hasToBeSent() || onOffDataContainer.One_hasToBeBeSent(localTime) || isLast15SecondsOfDay)
      {    
        //Create some buffer
        char sampleTime[25] {0};    // Buffer to hold sampletime        
        char strData[100] {0};          // Buffer to hold display message
        
        char EtagBuffer[50] {0};    // Buffer to hold returned Etag

        // Create az_span to hold partitionkey
        char partKeySpan[25] {0};
        size_t partitionKeyLength = 0;
        az_span partitionKey = AZ_SPAN_FROM_BUFFER(partKeySpan);
        
