RoSchmi/Esp32_Viessm_DatBase_Bridge/src/main.cpp
            if (analogSensorMgr.HasToBeRead(pSensorIndex, dateTimeUTCNow))
            {                     
              switch (pSensorIndex)
              {
                case 0:
                    {
                      // must be called in the first case
                      feedResult = soundSwitcher.feed();
                      if (feedResult.isValid)  
                      {
                        float soundValues[2] = {0};
                        soundValues[0] = feedResult.avValue;
                        soundValues[1] = feedResult.highAvValue;
                        analogSensorMgr.SetReadTimeAndValues(pSensorIndex, dateTimeUTCNow, soundValues[1], soundValues[0], MAGIC_NUMBER_INVALID);
                        
                        //theRead = feedResult.highAvValue / 10;

                        // Function not used in this App, can be used to display another sensor
                        theRead = MAGIC_NUMBER_INVALID;

                        // Take theRead (nearly) 0.0 as invalid
                        // (if no sensor is connected the function returns 0)                        
                        if (theRead > - 0.00001 && theRead < 0.00001)
                        {
                          theRead = MAGIC_NUMBER_INVALID;
                        }
                      }                                                                               
                    }
                    break;

                case 1:
                    {
                      if (feedResult.isValid)  
                      {
                        float soundValues[2] = {0};
                        soundValues[0] = feedResult.avValue;
                        soundValues[1] = feedResult.highAvValue;
                        
                        // Here we look if the sound sensor was updated in this loop
                        // If yes, we can get the average value from the index 0 sensor
                        AnalogSensor tempSensor = analogSensorMgr.GetSensorDates(0);
                        if (tempSensor.LastReadTime.operator==(dateTimeUTCNow))
                        {
                          analogSensorMgr.SetReadTimeAndValues(pSensorIndex, dateTimeUTCNow, soundValues[1], soundValues[0], MAGIC_NUMBER_INVALID);
                          theRead = feedResult.avValue / 10;
                          // is limited to be not more than 100
                          theRead = theRead <= 100 ? theRead : 100.0;
                            // Take theRead (nearly) 0.0 as invalid
                            // (if no sensor is connected the function returns 0)                        
                            if ((theRead > - 0.00001 && theRead < 0.00001))
                            {      
                                  theRead = MAGIC_NUMBER_INVALID;                                                  
                            }
                        }                             
                      }                
                    }
                    break;
                case 2:
                    {  
                        // Show ascending lines from 0 to 5, so re-boots of the board are indicated                                                
                        theRead = ((double)(insertCounterAnalogTable % 50)) / 10;
                        return theRead;                                                                   
                    }
                    break;
                case 3:
                    {
                      // Line for the switch threshold
                      theRead = atoi((char *)sSwiThresholdStr) / 10; // dummy
                      /*
                      if (!viessmannUserId_is_read)
                      {
                        readUserFromApi(myX509Certificate, myViessmannApiAccountPtr);
                      }
                      */
                    }                   
                    break;
              }
            }                    
            return theRead ;
#endif

#ifdef USE_SIMULATED_SENSORVALUES
      #ifdef USE_TEST_VALUES
            // Here you can select that diagnostic values (for debugging)
            // are sent to your storage table
            double theRead = MAGIC_NUMBER_INVALID;
            switch (pSensorIndex)
            {
                case 0:
                    {
                        theRead = timeNtpUpdateCounter;
                        theRead = theRead / 10; 
                    }
                    break;

                case 1:
                    {                       
                        theRead = sysTimeNtpDelta > 140 ? 140 : sysTimeNtpDelta < - 40 ? -40 : (double)sysTimeNtpDelta;                      
                    }
                    break;
                case 2:
                    {
                        theRead = insertCounterAnalogTable;
                        theRead = theRead / 10;                      
                    }
                    break;
                case 3:
                    {
                        theRead = lastResetCause;                       
                    }
                    break;
            }

            return theRead ;

  

        #endif
            
            onOffSwitcherWio.SetActive();
            // Only as an example we here return values which draw a sinus curve            
            int frequDeterminer = 4;
            int y_offset = 1;
            // different frequency and y_offset for aIn_0 to aIn_3
            if (pSensorIndex == 0)
            { frequDeterminer = 4; y_offset = 1; }
            if (pSensorIndex == 1)
            { frequDeterminer = 8; y_offset = 10; }
            if (pSensorIndex == 2)
            { frequDeterminer = 12; y_offset = 20; }
            if (pSensorIndex == 3)
            { frequDeterminer = 16; y_offset = 30; }
             
            int secondsOnDayElapsed = dateTimeUTCNow.second() + dateTimeUTCNow.minute() * 60 + dateTimeUTCNow.hour() *60 *60;

            // RoSchmi
            switch (pSensorIndex)
            {
              case 3:
              {

                //return (double)9.9;   // just something for now
                return lastResetCause;
              }
              break;
            
