RoSchmi/Esp32_Viessm_DatBase_Bridge/src/main.cpp
              case 2:
              { 
                uint32_t showInsertCounter = insertCounterAnalogTable % 50;               
                double theRead = ((double)showInsertCounter) / 10;
                return theRead;
              }
              break;
              case 0:
              case 1:
              {
                return roundf((float)25.0 * (float)sin(PI / 2.0 + (secondsOnDayElapsed * ((frequDeterminer * PI) / (float)86400)))) / 10  + y_offset;          
              }
              break;
              default:
              {
                return 0;
              }
            }
  #endif
}
void createSampleTime(DateTime dateTimeUTCNow, int timeZoneOffsetUTC, char * sampleTime)
{
  int hoursOffset = timeZoneOffsetUTC / 60;
  int minutesOffset = timeZoneOffsetUTC % 60;
  char sign = timeZoneOffsetUTC < 0 ? '-' : '+';
  char TimeOffsetUTCString[10];
  sprintf(TimeOffsetUTCString, " %c%03i", sign, timeZoneOffsetUTC);
  TimeSpan timespanOffsetToUTC = TimeSpan(0, hoursOffset, minutesOffset, 0);
  DateTime newDateTime = dateTimeUTCNow + timespanOffsetToUTC;
  sprintf(sampleTime, "%02i/%02i/%04i %02i:%02i:%02i%s",newDateTime.month(), newDateTime.day(), newDateTime.year(), newDateTime.hour(), newDateTime.minute(), newDateTime.second(), TimeOffsetUTCString);
}
 
void makeRowKey(DateTime actDate,  az_span outSpan, size_t *outSpanLength)
{
  // formatting the RowKey (= reverseDate) this way to have the tables sorted with last added row upmost
  char rowKeyBuf[20] {0};

  sprintf(rowKeyBuf, "%4i%02i%02i%02i%02i%02i", (10000 - actDate.year()), (12 - actDate.month()), (31 - actDate.day()), (23 - actDate.hour()), (59 - actDate.minute()), (59 - actDate.second()));
  az_span retValue = az_span_create_from_str((char *)rowKeyBuf);
  az_span_copy(outSpan, retValue);
  *outSpanLength = retValue._internal.size;         
}

void makePartitionKey(const char * partitionKeyprefix, bool augmentWithYear, DateTime dateTime, az_span outSpan, size_t *outSpanLength)
{
  // if wanted, augment with year and month (12 - month for right order)                    
  char dateBuf[20] {0};
  sprintf(dateBuf, "%s%d-%02d", partitionKeyprefix, (dateTime.year()), (12 - dateTime.month()));                  
  az_span ret_1 = az_span_create_from_str((char *)dateBuf);
  az_span ret_2 = az_span_create_from_str((char *)partitionKeyprefix);                       
  if (augmentWithYear == true)
  {
    az_span_copy(outSpan, ret_1);            
    *outSpanLength = ret_1._internal.size; 
  }
    else
  {
    az_span_copy(outSpan, ret_2);
    *outSpanLength = ret_2._internal.size;
  }    
}

bool extractSubString (const char * source, const String startTag, const String endTag, char * result, const int maxResultLength)
{
  char * start = strstr(source, startTag.c_str());
  if (start)
  {
    start += startTag.length();
    const char * end = strstr(start, endTag.c_str());
    if (end)
    {
      size_t length = end - start < maxResultLength - 1 ? end - start : maxResultLength - 1;
      strncpy(result, start, length);
      result[length] = '\0';      
      return true;
    }
    else
    {
      result[0] = '\0';
      return false;
    }
  }
  else
  {
     result[0] = '\0';
     return false;
  }
}

t_httpCode readFeaturesFromApi(X509Certificate pCaCert, ViessmannApiAccount * myViessmannApiAccountPtr, const uint32_t data_0_id, const char * p_gateways_0_serial, const char * p_gateways_0_devices_0_id, ViessmannApiSelection * apiSelectionPtr)
{  
   #if VIESSMANN_TRANSPORT_PROTOCOL == 1
    static WiFiClientSecure wifi_client;
  #else
    static WiFiClient wifi_client;
  #endif

  #if VIESSMANN_TRANSPORT_PROTOCOL == 1 
    wifi_client.setCACert(myX509Certificate);
  #endif

  #if WORK_WITH_WATCHDOG == 1
      esp_task_wdt_reset();
  #endif

  memset(bufferStorePtr, '\0', bufferStoreLength);
  ViessmannClient viessmannClient(myViessmannApiAccountPtr, pCaCert,  httpPtr, &wifi_client, bufferStorePtr);
  
  t_httpCode responseCode = viessmannClient.GetFeatures(bufferStorePtr, bufferStoreLength, data_0_id, Gateways_0_Serial, Gateways_0_Devices_0_Id, apiSelectionPtr);
  Serial.printf("\r\nFeatures httpResponseCode is: %d\r\n", responseCode);
  if (responseCode == t_http_codes::HTTP_CODE_OK)
      {
        #if SERIAL_PRINT == 1
        Serial.println(F("Print values from Api-Selection:"));
        
        Serial.printf("%s    %s\r\n", apiSelectionPtr ->_3_temperature_main.name, apiSelectionPtr ->_3_temperature_main.value);       
        Serial.printf("%s    %s\r\n", apiSelectionPtr ->_5_boiler_temperature.name, apiSelectionPtr ->_5_boiler_temperature.value);       
        Serial.printf("%s    %s\r\n", apiSelectionPtr ->_7_burner_modulation.name, apiSelectionPtr ->_7_burner_modulation.value);       
        Serial.printf("%s    %s\r\n", apiSelectionPtr ->_8_burner_hours.name, apiSelectionPtr ->_8_burner_hours.value);
        Serial.printf("%s    %s\r\n", apiSelectionPtr ->_8_burner_starts.name, apiSelectionPtr ->_8_burner_starts.value);
        Serial.printf("%s    %s\r\n", apiSelectionPtr ->_9_burner_is_active.name, apiSelectionPtr ->_9_burner_is_active.value);
        Serial.printf("%s    %s\r\n", apiSelectionPtr ->_23_heating_curve_shift.name, apiSelectionPtr ->_23_heating_curve_shift.value);
        Serial.printf("%s    %s\r\n", apiSelectionPtr ->_23_heating_curve_slope.name, apiSelectionPtr ->_23_heating_curve_slope.value);
        Serial.printf("%s    %s\r\n", apiSelectionPtr ->_77_temperature_supply.name, apiSelectionPtr ->_77_temperature_supply.value);
        Serial.printf("%s    %s\r\n", apiSelectionPtr ->_85_heating_dhw_charging.name, apiSelectionPtr ->_85_heating_dhw_charging.value);
        Serial.printf("%s    %s\r\n", apiSelectionPtr ->_86_heating_dhw_pump_status.name, apiSelectionPtr ->_86_heating_dhw_pump_status.value);
        Serial.printf("%s    %s\r\n", apiSelectionPtr ->_88_heating_dhw_pump_primary_status.name, apiSelectionPtr ->_88_heating_dhw_pump_primary_status.value);
        Serial.printf("%s    %s\r\n", apiSelectionPtr ->_90_heating_dhw_cylinder_temperature.name, apiSelectionPtr ->_90_heating_dhw_cylinder_temperature.value);
        Serial.printf("%s    %s\r\n", apiSelectionPtr ->_92_heating_dhw_outlet_temperature.name, apiSelectionPtr ->_92_heating_dhw_outlet_temperature.value);
        Serial.printf("%s    %s\r\n", apiSelectionPtr ->_93_heating_dhw_main_temperature.name, apiSelectionPtr ->_93_heating_dhw_main_temperature.value);
        Serial.printf("%s    %s\r\n", apiSelectionPtr ->_95_heating_temperature_outside.name, apiSelectionPtr ->_95_heating_temperature_outside.value);
        
        #endif
         

