RoSchmi/Esp32_Viessm_DatBase_Bridge/src/main.cpp
        /*
        Serial.println(apiSelection._5_Boiler_temperature.name);
        Serial.println(apiSelection._5_Boiler_temperature.timestamp);
        Serial.println(apiSelection._5_Boiler_temperature.value);
        */

        /*
        const char* json = (char *)bufferStorePtr;
        JsonDocument doc;
        deserializeJson(doc, json);
        const char * tempOutside = doc["data"][95]["properties"]["value"]["unit"];
        */
        //Serial.println("Temperature outside");
        //Serial.printf("\r\n%s\r\n", tempOutside);
        
        //Serial.println((char *)bufferStorePtr);

        

        /*
        uint32_t data_0_id = doc["data"][0]["id"];
        const char * data_0_description = doc["data"][0]["description"];
        const char * data_0_address_street = doc["data"][0]["address"]["street"];
        const char * data_0_address_houseNumber = doc["data"][0]["address"]["houseNumber"];
        const char * gateways_0_serial = doc["data"][0]["gateways"][0]["serial"];
        const char * gateways_0_devices_0_id = doc["data"][0]["gateways"][0]["devices"][0]["id"];
        */

       // *p_data_0_id = data_0_id;
       // memset(bufferStorePtr, '\0', bufferStoreLength);
        /*
        memset(p_data_0_description, '\0', equipBufLen);
        memset(p_data_0_address_street, '\0', equipBufLen);
        memset(p_data_0_address_houseNumber,'\0', equipBufLen);

        memset(p_gateways_0_serial,'\0', equipBufLen);
        memset(p_gateways_0_devices_0_id,'\0', equipBufLen);

        strncpy(p_data_0_description, data_0_description, equipBufLen - 1);
        strncpy(p_data_0_address_street, data_0_address_street, equipBufLen - 1);
        strncpy(p_data_0_address_houseNumber, data_0_address_houseNumber, equipBufLen - 1);

        strncpy(p_gateways_0_serial, gateways_0_serial, equipBufLen - 1);
        strncpy(p_gateways_0_devices_0_id, gateways_0_devices_0_id, equipBufLen - 1);
        */       
      }

  //responseCode = t_http_codes::HTTP_CODE_OK;
  return responseCode;
}

t_httpCode readEquipmentFromApi(X509Certificate pCaCert, ViessmannApiAccount * myViessmannApiAccountPtr, uint32_t * p_data_0_id, const int equipBufLen, char * p_data_0_description, char * p_data_0_address_street, char * p_data_0_address_houseNumber, char * p_gateways_0_serial, char * p_gateways_0_devices_0_id)
{
  #if VIESSMANN_TRANSPORT_PROTOCOL == 1
    static WiFiClientSecure wifi_client;
  #else
    static WiFiClient wifi_client;
  #endif

    #if VIESSMANN_TRANSPORT_PROTOCOL == 1
    
    wifi_client.setCACert(myX509Certificate);
  #endif

  #if WORK_WITH_WATCHDOG == 1
      esp_task_wdt_reset();
  #endif
  ViessmannClient viessmannClient(myViessmannApiAccountPtr, pCaCert,  httpPtr, &wifi_client, bufferStorePtr);
   #if SERIAL_PRINT == 1
        Serial.println(myViessmannApiAccount.ClientId);
      #endif
      
      memset(bufferStorePtr, '\0', bufferStoreLength); 
      t_httpCode responseCode = viessmannClient.GetEquipment(bufferStorePtr, bufferStoreLength);
          
      Serial.printf("\r\nEquipment httpResponseCode is: %d\r\n", responseCode);

      if (responseCode == t_http_codes::HTTP_CODE_OK)
      {
        const char* json = (char *)bufferStorePtr;
        JsonDocument doc;
        deserializeJson(doc, json);
        
        uint32_t data_0_id = doc["data"][0]["id"];
        const char * data_0_description = doc["data"][0]["description"];
        const char * data_0_address_street = doc["data"][0]["address"]["street"];
        const char * data_0_address_houseNumber = doc["data"][0]["address"]["houseNumber"];
        const char * gateways_0_serial = doc["data"][0]["gateways"][0]["serial"];
        const char * gateways_0_devices_0_id = doc["data"][0]["gateways"][0]["devices"][0]["id"];
        
        *p_data_0_id = data_0_id;
        memset(bufferStorePtr, '\0', bufferStoreLength);
         
        memset(p_data_0_description, '\0', equipBufLen);
        memset(p_data_0_address_street, '\0', equipBufLen);
        memset(p_data_0_address_houseNumber,'\0', equipBufLen);

        memset(p_gateways_0_serial,'\0', equipBufLen);
        memset(p_gateways_0_devices_0_id,'\0', equipBufLen);

        strncpy(p_data_0_description, data_0_description, equipBufLen - 1);
        strncpy(p_data_0_address_street, data_0_address_street, equipBufLen - 1);
        strncpy(p_data_0_address_houseNumber, data_0_address_houseNumber, equipBufLen - 1);

        strncpy(p_gateways_0_serial, gateways_0_serial, equipBufLen - 1);
        strncpy(p_gateways_0_devices_0_id, gateways_0_devices_0_id, equipBufLen - 1);       
      }
  return responseCode; 
}

t_httpCode readUserFromApi(X509Certificate pCaCert, ViessmannApiAccount * myViessmannApiAccountPtr)
{
  #if VIESSMANN_TRANSPORT_PROTOCOL == 1
    static WiFiClientSecure wifi_client;
  #else
    static WiFiClient wifi_client;
  #endif

    #if VIESSMANN_TRANSPORT_PROTOCOL == 1
    wifi_client.setCACert(myX509Certificate);
  #endif

  #if WORK_WITH_WATCHDOG == 1
      esp_task_wdt_reset();
  #endif

  ViessmannClient viessmannClient(myViessmannApiAccountPtr, pCaCert,  httpPtr, &wifi_client, bufferStorePtr);
   #if SERIAL_PRINT == 1
        Serial.println(myViessmannApiAccount.ClientId);
      #endif
      memset(viessmannApiUser,'\0', viessmannUserBufLen);
      memset(bufferStorePtr,'\0', bufferStoreLength);
      t_httpCode responseCode = viessmannClient.GetUser(bufferStorePtr, bufferStoreLength);
      Serial.printf("\r\nUser httpResponseCode is: %d\r\n", responseCode);
      
      if (responseCode == t_http_codes::HTTP_CODE_OK)
      {
        uint16_t cntToCopy = strlen((char*)bufferStorePtr) < viessmannUserBufLen ? strlen((char*)bufferStorePtr) : viessmannUserBufLen -1;
        memcpy(viessmannApiUser, bufferStorePtr, cntToCopy);
        // viessmannUserId_is_read = true;  // has now another place
      }    
return responseCode;
}

az_http_status_code createTable(CloudStorageAccount *pAccountPtr, X509Certificate pCaCert, const char * pTableName)
{ 

  #if TRANSPORT_PROTOCOL == 1
    static WiFiClientSecure wifi_client;
  #else
    static WiFiClient wifi_client;
  #endif

    #if TRANSPORT_PROTOCOL == 1
    wifi_client.setCACert(myX509Certificate);
    //wifi_client.setCACert(baltimore_corrupt_root_ca);
  #endif

  #if WORK_WITH_WATCHDOG == 1
      esp_task_wdt_reset();
  #endif
  
  // RoSchmi
  TableClient table(pAccountPtr, pCaCert,  httpPtr, &wifi_client, bufferStorePtr);

  // Create Table
  az_http_status_code statusCode = table.CreateTable(pTableName, dateTimeUTCNow, ContType::contApplicationIatomIxml, AcceptType::acceptApplicationIjson, returnContent, false);
  
   // RoSchmi for tests: to simulate failed upload
   //az_http_status_code   statusCode = AZ_HTTP_STATUS_CODE_UNAUTHORIZED;

